#pragma once

/*
분류명 : 계 (Kingdom)
구성 : 동물계 (Animalia) ...

가장 널리 알려진 분류 체계는 역(Domain) 단위로 나누어진 고세균계와 진정세균계를 포함하여, 진핵생물역의 원생생물계[1], 균계, 식물계, 동물계의 6계 체제이다. [2]

그러나 일부 고세균, 원핵생물 등은 그 유전적 차이가 동물-식물-균류의 차이보다 훨씬 크며, 

따라서 이러한 생물들을 동일한 한 계로 구분하던 기존에 6계 체계도 더욱 더 많은 계들로 나뉘어져야 한다는 최근의 연구도 있다.

대표적으로 제안되고 있는 계들은 고세균역의 Korarchaeota계, Crenacrchaota계, Euryarchaeota계, 진핵생물의 식물계, 동물계, 균계, Amoebozoa계, Chromalveolata계, Rhizaria계, Excavat계 등이 있다.

또한 일부 생물학자들은 이러한 계 단위의 구분이 원생생물의 계통수를 나타내는 데에는 별로 좋지 않은 표현으로 생각하여 계 단위의 분류를 포기하고 진화 계통을 더 잘 표현할 수 있는 계통군을 제시하기도 한다.

*/

class Kingdom
{

};