/* 

******************************************************
					MIT License
			Copyright (c) 2018 CSID-DGU
******************************************************

Coded by : Byeong Seok Oh
Last Updated : 18-11-05

분류 : 종
학명 : 혹등고래(Megaptera novaeangliae)
설명 : 혹등고래속의 유일한 종으로 긴수염고래와 유전적으로 가깝다. 
	   남방혹등고래, 북태평양혹등고래, 북대서양혹등고래 3 종의 아종이 있다.
	   뭉툭하게 생긴 몸체를 지니고 있으며 입 근처의 머리와 아랫턱에 많은 혹이 나있다. 
	   꼬리가 크고 지느러미발이 무척 길며 입 안에는 아래 위 양쪽으로 각각 270 가닥에서 400 가닥에 이르는 어두운 색상의 고래 수염이 나있다. 각 수염의 길이는 46 - 91 cm이다.
	   배에는 배꼽 부근에서 아랫턱에 이르는 깊은 주름이 좌우 대칭으로 나있다. 이 주름은 14 - 22 개 정도이다.
	   암컷은 반구형으로 돌출된 생식공을 가지고 있어 수컷과 구별된다. 수컷은 짝짓기를 하지 않을 땐 생식기가 생식공 안에 감추어져 있다. 
	   새끼는 열대와 아열대의 월동해역에서 태어난다.
	   다 자란 혹등고래 수컷의 몸길이는 대략 13 - 14 m 정도이고, 암컷은 조금 더 크게 자라 14 - 15 m 정도이다. 큰 개체 경우 몸길이 19 m, 지느러미발 길이는 6 m에 이르는 것도 있다.
	   북경 65도에서 남경 60도에 이르기까지 넓게 분포한다. 여름에는 차가운 고위도 지방에서 나고, 겨울에는 번식을 위해 열대나 아열대로 회유한다. 
	   포유류 가운데 이동을 매우 많이 하는 편에 속하며, 연간 회유 경로가 약 25,000 km에 이른다. 
	   단, 아라비아 해 개체군은 열대 해역을 벗어나지 않으며 지중해 동쪽, 발트 해, 북극해에는 분포하지 않는다.
	   몸에 있는 여러 패턴의 차이로 개체를 구별할 수 있다.(휠록 대학교(wheelock university)의 웨일넷 데이터는 꼬리지느러미의 문양을 등록하여 개체를 기록 중)

출처 : https://ko.wikipedia.org/wiki/%ED%98%B9%EB%93%B1%EA%B3%A0%EB%9E%98

*/

#pragma once
#include "genus_megaptera.hpp"

class HumpBackWhale : public Megaptera
{
public:
	HumpBackWhale() 
	{

	}
		
	~HumpBackWhale()
	{

	}



};

